Tekla Open API Reference for Tekla Structures 2025
TextElement Properties
The TextElement type exposes the following members.
Properties
Name | Description
Font
 The font of the text element.
Value
 The textual value of the text element.
Top
See Also
Reference
TextElement Class
Tekla.Structures.Drawing Namespace